Revit 2027 API
RebarShapeDrivenAccessor.Pitch Property
 For a spiral, the pitch, or vertical distance traveled in one rotation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Pitch { get; set; }
Public Property Pitch As Double
	Get
	Set
public:
property double Pitch {
	double get ();
	void set (double value);
}
member Pitch : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: pitch must be positive.
InvalidOperationException |  This RebarShapeDrivenAccessor is not an instance of a spiral shape. -or- This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
Remarks
 Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.
See Also
Reference
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace